WSDL/ShipService/Ship_v23/v23/21. Delete Shipment_SUCCESS__OK.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v23="http://fedex.com/ws/ship/v23">
   <soapenv:Header/>
   <soapenv:Body>
      <v23:DeleteShipmentRequest>
         <v23:WebAuthenticationDetail>
            <v23:ParentCredential>
               <v23:Key>INPUT YOUR INFORMATION</v23:Key>
               <v23:Password>INPUT YOUR INFORMATION</v23:Password>
            </v23:ParentCredential>
            <v23:UserCredential>
               <v23:Key>INPUT YOUR INFORMATION</v23:Key>
               <v23:Password>INPUT YOUR INFORMATION</v23:Password>
            </v23:UserCredential>
         </v23:WebAuthenticationDetail>
         <v23:ClientDetail>
            <v23:AccountNumber>INPUT YOUR INFORMATION</v23:AccountNumber>
            <v23:MeterNumber>INPUT YOUR INFORMATION</v23:MeterNumber>
            <v23:IntegratorId>12345</v23:IntegratorId>
            <v23:Localization>
               <v23:LanguageCode>EN</v23:LanguageCode>
               <v23:LocaleCode>EM</v23:LocaleCode>
            </v23:Localization>
         </v23:ClientDetail>
         <v23:TransactionDetail>
            <v23:CustomerTransactionId>DeleteShipmentRequest_v23.1</v23:CustomerTransactionId>
         </v23:TransactionDetail>
         <v23:Version>
            <v23:ServiceId>ship</v23:ServiceId>
            <v23:Major>23</v23:Major>
            <v23:Intermediate>0</v23:Intermediate>
            <v23:Minor>0</v23:Minor>
         </v23:Version>
         <v23:ShipTimestamp>2017-12-16T12:34:56-06:00</v23:ShipTimestamp>
         <v23:TrackingId>
            <v23:TrackingIdType>EXPRESS</v23:TrackingIdType>
            <v23:FormId>0850</v23:FormId>
            <v23:TrackingNumber>794909388090</v23:TrackingNumber>
         </v23:TrackingId>
         <v23:DeletionControl>DELETE_ALL_PACKAGES</v23:DeletionControl>
      </v23:DeleteShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>


Response:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ShipmentReply xmlns="http://fedex.com/ws/ship/v23">
         <HighestSeverity>SUCCESS</HighestSeverity>
         <Notifications>
            <Severity>SUCCESS</Severity>
            <Source>ship</Source>
            <Code>0000</Code>
            <Message>Success</Message>
            <LocalizedMessage>Success</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>DeleteShipmentRequest_v23.1</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>23</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
      </ShipmentReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


Additional Info:
URL:https://wsdrt.idev.fedex.com:443/web-services
Date:Thu Dec 14 19:50:07 IST 2017
TimeTaken:2360ms
